//----------------------------------------------------------------------------------------------------------------------
// 1. Створити пустий масив та :
//     a. заповнити його 50 парними числами за допомоги циклу.
//     b. заповнити його 50 непарними числами за допомоги циклу.
//     c. Заповнити масив 20ма рандомними числами. (Google: Generate random number JS)
// d. Заповнити масив 20ма рандомними чисалами в діапазоні від 8 до 732 (Google: Generate random number JS)
// 2. Вивести за допомогою console.log кожен третій елемен
// 3. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним.
// 4. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним та записати їх в новий масив
// 5. Вивести кожен елемент масиву, сусід справа якого є парним
// EXAMPLE: [ 1, 2, 3, 5, 7, 9, 56, 8, 67 ] -> Має бути виведено 1, 9, 56
// 6. Є масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. Обрахувати середній чек.
//
// 7. Створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.
// 8. Створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому, і якщо елемент є числом - додати його в інший масив.
//----------------------------------------------------------------------------------------------------------------------
//     a. заповнити його 50 парними числами за допомоги циклу.
//----------------------------------------------------------------------------------------------------------------------
// let main = [];
// for (let i = 0; i < 50; i++) {
//     if (i % 2 === 0) {
//         main[i] = i;
//     } else {
//         main[i] = '-'
//     }
// }
// console.log(main);
//Щоб без empty потрібно використати push(), але ми ще не вчили, тому я не знаю як позбутись empty.
//----------------------------------------------------------------------------------------------------------------------
//     b. заповнити його 50 непарними числами за допомоги циклу.
//----------------------------------------------------------------------------------------------------------------------
// let main = [];
// for (let i = 0; i < 50; i++) {
//     if (i % 2 !== 0) {
//         main[i] = i;
//     } else {
//         main[i] = '-'
//     }
// }
// console.log(main);
//----------------------------------------------------------------------------------------------------------------------
//     c. Заповнити масив 20ма рандомними числами. (Google: Generate random number JS)
//----------------------------------------------------------------------------------------------------------------------
// let main = [];
// for (let i = 0; i < 20; i++) {
//     main[i] = Math.floor(Math.random() * 11);
// }
// console.log(main);
//----------------------------------------------------------------------------------------------------------------------
// d. Заповнити масив 20ма рандомними чисалами в діапазоні від 8 до 732 (Google: Generate random number JS)
//----------------------------------------------------------------------------------------------------------------------
// let main = [];
// for (let i = 0; i < 20; i++) {
//     main[i] = Math.floor(Math.random() * (732 - 8)) + 8
// }
// console.log(main);
//----------------------------------------------------------------------------------------------------------------------
// 2. Вивести за допомогою console.log кожен третій елемен
//----------------------------------------------------------------------------------------------------------------------
// for (let i = 0; i < main.length; i += 3) {
//     console.log(main[i]);
// }
//----------------------------------------------------------------------------------------------------------------------
// 3. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним.
//----------------------------------------------------------------------------------------------------------------------
// for (let i = 0; i < main.length; i += 3) {
//     if (main[i] % 2 === 0) {
//         console.log(main[i]);
//     }
// }
//----------------------------------------------------------------------------------------------------------------------
// 4. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним та записати їх в новий масив
//----------------------------------------------------------------------------------------------------------------------
// let newMain = [];
// for (let i = 0; i < main.length; i += 3) {
//     if (main[i] % 2 === 0) {
//         newMain[i] = main[i];
//     }
// }
// console.log(newMain);
//----------------------------------------------------------------------------------------------------------------------
// 5. Вивести кожен елемент масиву, сусід справа якого є парним
//----------------------------------------------------------------------------------------------------------------------
// for (let i = 0; i < main.length; i++) {
//     if (main[i + 1] % 2 === 0) {
//         console.log(main[i]);
//     }
// }
//----------------------------------------------------------------------------------------------------------------------
// 6. Є масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. Обрахувати середній чек.
//----------------------------------------------------------------------------------------------------------------------
// const values = [100,250,50,168,120,345,188];
//
// let sum = 0;
// for (let item of values) {
//     sum += item;
// }
// console.log(sum / values.length);
//----------------------------------------------------------------------------------------------------------------------
// 7. Створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.
//----------------------------------------------------------------------------------------------------------------------
// let main = [];
// let newArr = [];
// for (let i = 0; i < 10; i++) {
//     main[i] = (Math.floor(Math.random()* (100 - 1) + 1)) * 5;
//     newArr[i] = main[i];
// }
// console.log(newArr);
//----------------------------------------------------------------------------------------------------------------------
// 8. Створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому, і якщо елемент є числом - додати його в інший масив.
//----------------------------------------------------------------------------------------------------------------------
// let main = [1,'a',true,2,'b',false,3,'c',true];
// let newArr = [];
//
// for (let i = 0; i < main.length; i++) {
//     if (typeof main[i] === 'number') {
//         newArr[i] = main[i];
//     }
// }
// console.log(newArr);
//----------------------------------------------------------------------------------------------------------------------
// - Дано 2 масиви з рівною кількістю об'єктів.
// Масиви:
//     let usersWithId = [
//         {id: 1, name: 'vasya', age: 31, status: false},
//         {id: 2, name: 'petya', age: 30, status: true},
//         {id: 3, name: 'kolya', age: 29, status: true},
//         {id: 4, name: 'olya', age: 28, status: false}
//     ];
//
// let citiesWithId = [
//     {user_id: 3, country: 'USA', city: 'Portland'},
//     {user_id: 1, country: 'Ukraine', city: 'Ternopil'},
//     {user_id: 2, country: 'Poland', city: 'Krakow'},
//     {user_id: 4, country: 'USA', city: 'Miami'}
// ];
//
// З'єднати в один об'єкт користувача та місто з відповідними "id" та "user_id".
//     Записати цей об'єкт в новий масив
// Example:
//     let usersWithCities = [
//         {
//             id: 1, // <===
//             name: 'vasya',
//             age: 31,
//             status: false,
//             address: {
//                 user_id: 1, // <===
//                 country: 'Ukraine',
//                 city: 'Ternopil'
//             }
//         },
//         // TO BE CONTINUED .....
//     ]
//----------------------------------------------------------------------------------------------------------------------
// let usersWithId = [
//     {id: 1, name: 'vasya', age: 31, status: false},
//     {id: 2, name: 'petya', age: 30, status: true},
//     {id: 3, name: 'kolya', age: 29, status: true},
//     {id: 4, name: 'olya', age: 28, status: false}
// ];
//
// let citiesWithId = [
//     {user_id: 3, country: 'USA', city: 'Portland'},
//     {user_id: 1, country: 'Ukraine', city: 'Ternopil'},
//     {user_id: 2, country: 'Poland', city: 'Krakow'},
//     {user_id: 4, country: 'USA', city: 'Miami'}
// ];
// let newArr = [];
// for (let i = 0; i < usersWithId.length; i++) {
//     for (let j = 0; j < citiesWithId.length; j++) {
//         if (usersWithId[i].id === citiesWithId[j].user_id) {
//             newArr[i] = {
//                 id: usersWithId[i].id,
//                 name: usersWithId[i].name,
//                 age: usersWithId[i].age,
//                 status: usersWithId[i].status,
//                 address: {
//                     user_id: citiesWithId[j].user_id,
//                     country: citiesWithId[j].country,
//                     city: citiesWithId[j].city
//                 }
//             }
//         }
//     }
// }
// console.log(newArr);
//----------------------------------------------------------------------------------------------------------------------