//----------------------------------------------------------------------------------------------------------------------
// - Знайти та вивести довижину настипних стрінгових значень
// 'hello world', 'lorem ipsum', 'javascript is cool'
// - Перевести до великого регістру наступні стрінгові значення
// 'hello world', 'lorem ipsum', 'javascript is cool'
// - Перевести до нижнього регістру настипні стрінгові значення
// 'HELLO WORLD', 'LOREM IPSUM', 'JAVASCRIPT IS COOL'
// - Є "брудна" стрінга let str = ' dirty string   ' . Почистити її від зайвих пробілів.
//
// - Напишіть функцію stringToarray(str), яка перетворює рядок на масив слів.
//     let str = 'Ревуть воли як ясла повні';
// let arr = stringToarray(str); ['Ревуть', 'воли', 'як', 'ясла', 'повні']
//
// - є масив чисел [10,8,-7,55,987,-1011,0,1050,0] . за допомоги map  перетворити всі об'єкти в масиві на стрінгові.
// - створити функцію sortNums(direction), яка прймає масив чисел, та сортує його від більшого до меньшого, або навпаки в залежності від значення аргументу direction.
//     let nums = [11,21,3];
// sortNums(nums,'ascending') // [3,11,21]
// sortNums(nums,'descending') // [21,11,3]
//----------------------------------------------------------------------------------------------------------------------
// - Знайти та вивести довижину настипних стрінгових значень
// 'hello world', 'lorem ipsum', 'javascript is cool'
//----------------------------------------------------------------------------------------------------------------------
// const main = ['hello world', 'lorem ipsum', 'javascript is cool'];
// let length = [];
// main.forEach(item => length.push(item.length));
// console.log(length);
//----------------------------------------------------------------------------------------------------------------------
// - Перевести до великого регістру наступні стрінгові значення
// 'hello world', 'lorem ipsum', 'javascript is cool'
//----------------------------------------------------------------------------------------------------------------------
// let main = ['hello world', 'lorem ipsum', 'javascript is cool'];
// main.forEach(item => console.log(item.toUpperCase()));
//----------------------------------------------------------------------------------------------------------------------
// - Перевести до нижнього регістру настипні стрінгові значення
// 'HELLO WORLD', 'LOREM IPSUM', 'JAVASCRIPT IS COOL'
//----------------------------------------------------------------------------------------------------------------------
// let main = ['HELLO WORLD', 'LOREM IPSUM', 'JAVASCRIPT IS COOL'];
// main.forEach(item => console.log(item.toLowerCase()));
//----------------------------------------------------------------------------------------------------------------------
// - Є "брудна" стрінга let str = ' dirty string   ' . Почистити її від зайвих пробілів.
//----------------------------------------------------------------------------------------------------------------------
// let str = ' dirty string   ';
// console.log(str.slice(1, str.indexOf('g') + 1));
//----------------------------------------------------------------------------------------------------------------------
// - Напишіть функцію stringToarray(str), яка перетворює рядок на масив слів.
//     let str = 'Ревуть воли як ясла повні';
// let arr = stringToarray(str); ['Ревуть', 'воли', 'як', 'ясла', 'повні']
//----------------------------------------------------------------------------------------------------------------------
// let str = 'Ревуть воли як ясла повні';
// function stringToarray(str) {
//     return str.split(' ');
// }
//
// console.log(stringToarray(str));
//----------------------------------------------------------------------------------------------------------------------
// - є масив чисел [10,8,-7,55,987,-1011,0,1050,0] . за допомоги map  перетворити всі об'єкти в масиві на стрінгові.
//----------------------------------------------------------------------------------------------------------------------
// let numbers = [10,8,-7,55,987,-1011,0,1050,0];
// console.log(numbers.map(number => number.toString()));
//----------------------------------------------------------------------------------------------------------------------
// - створити функцію sortNums(direction), яка прймає масив чисел, та сортує його від більшого до меньшого, або навпаки в залежності від значення аргументу direction.
//     let nums = [11,21,3];
// sortNums(nums,'ascending') // [3,11,21]
// sortNums(nums,'descending') // [21,11,3]
//----------------------------------------------------------------------------------------------------------------------
// function sortNums(nums,direction) {
//     if (direction === 'ascending') {
//         console.log(nums.sort((num1, num2) => num1 - num2));
//     } else if (direction === 'descending') {
//         console.log(nums.sort((num1,num2) => num2 - num1))
//     }
// }
// sortNums([3,11,21],'ascending');
//----------------------------------------------------------------------------------------------------------------------
// - є масив
let coursesAndDurationArray = [
    {title: 'JavaScript Complex', monthDuration: 5},
    {title: 'Java Complex', monthDuration: 6},
    {title: 'Python Complex', monthDuration: 6},
    {title: 'QA Complex', monthDuration: 4},
    {title: 'FullStack', monthDuration: 7},
    {title: 'Frontend', monthDuration: 4}
];
// -- відсортувати його за спаданням за monthDuration
// -- відфільтрувати , залишивши тільки курси з тривалістю більше 5 місяців
// -- за допомоги map перетворити кожен елемент на наступний тип {id,title,monthDuration}
//----------------------------------------------------------------------------------------------------------------------
// -- відсортувати його за спаданням за monthDuration
//----------------------------------------------------------------------------------------------------------------------
// console.log(coursesAndDurationArray.sort((a, b) => b.monthDuration - a.monthDuration));
//----------------------------------------------------------------------------------------------------------------------
// -- відфільтрувати , залишивши тільки курси з тривалістю більше 5 місяців
//----------------------------------------------------------------------------------------------------------------------
// console.log(coursesAndDurationArray.filter(item => item.monthDuration > 5));
//----------------------------------------------------------------------------------------------------------------------
// -- за допомоги map перетворити кожен елемент на наступний тип {id,title,monthDuration}
//----------------------------------------------------------------------------------------------------------------------

//----------------------------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------------------------