//----------------------------------------------------------------------------------------------------------------------
// --створити масив з:
// - з 5 числових значень
// - з 5 стічкових значень
// - з 5 значень стрічкового, числового та булевого типу
// - та вивести його в консоль
//----------------------------------------------------------------------------------------------------------------------
// let main = [1,2,3,4,5,'a','b','c','d','e',['q','w','r','t','y'],[6,7,8,9,10],[true,false,true,false,true]];
// for (let item of main) {
//     console.log(item);
// }
//----------------------------------------------------------------------------------------------------------------------
// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
//----------------------------------------------------------------------------------------------------------------------
// let main = [1,2,3,'a','b','c',true,false,true];
// for (let i = 0; i < main.length; i++) {
//     console.log(main[i]);
// }
//----------------------------------------------------------------------------------------------------------------------
// - є масив [2,17,13,6,22,31,45,66,100,-18] :
// 1. перебрати його циклом while
//     2. перебрати його циклом for
//     3. перебрати циклом while та вивести  числа тільки з непарним індексом
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// 5. перебрати циклом while та вивести  числа тільки парні  значення
// 6. перебрати циклом for та вивести  числа тільки парні  значення
// 7. замінити кожне число кратне 3 на слово "okten"
// 8. вивести масив в зворотньому порядку.
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
//----------------------------------------------------------------------------------------------------------------------

//----------------------------------------------------------------------------------------------------------------------
