//----------------------------------------------------------------------------------------------------------------------
// --створити масив з:
// - з 5 числових значень
// - з 5 стічкових значень
// - з 5 значень стрічкового, числового та булевого типу
// - та вивести його в консоль
//----------------------------------------------------------------------------------------------------------------------
// let main = [1,2,3,4,5,'a','b','c','d','e',['q','w','r','t','y'],[6,7,8,9,10],[true,false,true,false,true]];
// for (let item of main) {
//     console.log(item);
// }
//----------------------------------------------------------------------------------------------------------------------
// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
//----------------------------------------------------------------------------------------------------------------------
// let main = [1,2,3,'a','b','c',true,false,true];
// for (let i = 0; i < main.length; i++) {
//     console.log(main[i]);
// }
//----------------------------------------------------------------------------------------------------------------------
