// Масиви та об'єкти:
// - Створити масив, наповнити його 10 елементами будь-якого типу, вивести кожен елемент в консоль
// - Створити 3 об'єкти які описують книги. Поля об'єкту : title ,pageCount, genre.
// - Створити 3 об'єкти які описують книги. Поля об'єкту : title ,pageCount, genre, authors. Поле "автори" - являється  масивом. Кожен автор має поля name та age.
// - Створити масив з 10 об'єктами які описують сутніть "користувач". Поля: name, username,password. Вивести в консоль пароль кожного користувача
//----------------------------------------------------------------------------------------------------------------------
// - Створити масив, наповнити його 10 елементами будь-якого типу, вивести кожен елемент в консоль
//----------------------------------------------------------------------------------------------------------------------
// const main = [1,2,3,'a','b','c',true,false,{},[]]
// console.log(main);
//----------------------------------------------------------------------------------------------------------------------
// - Створити 3 об'єкти які описують книги. Поля об'єкту : title ,pageCount, genre.
//----------------------------------------------------------------------------------------------------------------------
// const japaneseBook = {
//     title: 'All about Japan',
//     pageCount: 356,
//     genre: 'history',
// }
// const jsBook = {
//     title: 'JavaScript',
//     pageCount: 221,
//     genre: 'science',
// }
// const spaceBook = {
//     title: 'Space Adventures',
//     pageCount: 560,
//     genre: ['adventures', 'science fiction'],
// }
//----------------------------------------------------------------------------------------------------------------------
// - Створити 3 об'єкти які описують книги. Поля об'єкту : title ,pageCount, genre, authors. Поле "автори" - являється  масивом. Кожен автор має поля name та age.
//----------------------------------------------------------------------------------------------------------------------
// const onePiece_anime = {
//     title: 'One Piece',
//     pageCount: {pages: 1059, status: 'ongoing'},
//     genre: ['Adventure','Fantasy'],
//     authors: [
//         {name: 'Eiichiro Oda'},
//         {age: 48},
//     ]
// }
// const fairyTail_anime = {
//     title: 'Fairy Tail',
//     pageCount: 356,
//     genre: ['Adventure', 'Fantasy'],
//     authors: [
//         {name: 'Hiro Mashima'},
//         {age: 46},
//     ]
// }
// const naruto_anime = {
//     title: 'Naruto',
//     pageCount: 750,
//     genre: ['Adventure', 'Fantasy', 'Comedy'],
//     authors: [
//         {name: 'Masashi Kishimoto'},
//         {age: 48},
//     ]
// }
//----------------------------------------------------------------------------------------------------------------------
// - Створити масив з 10 об'єктами які описують сутніть "користувач". Поля: name, username,password. Вивести в консоль пароль кожного користувача
//----------------------------------------------------------------------------------------------------------------------
// const users = [
//     {name: 'Haruto', username: 'naruto_78', password: 48723},
//     {name: 'Yui', username: '_yuichanneru_', password: 98203},
//     {name: 'Souta', username: 'shootaOtaku', password: 45713},
//     {name: 'Hana', username: '#hanaMizu', password: 96726},
//     {name: 'Minato', username: 'fuenMinatosan', password: 71743},
//     {name: 'Ema', username: 'enmA', password: 55533},
//     {name: 'Riku', username: 'rikuMorty', password: 12729},
//     {name: 'Sakura', username: 'sakuraDaigaku', password: 28721},
//     {name: 'Kouki', username: 'Hikouki', password: 98929},
//     {name: 'Himari', username: 'shishiMaru', password: 11824},
// ]
// console.log(users[0].password,users[1].password,users[2].password,users[3].password,users[4].password,users[5].password,users[6].password,users[7].password,users[8].password,users[9].password)
//----------------------------------------------------------------------------------------------------------------------
// Логічні розгалуження:
//  - Є змінна х, якій ви надаєте довільне числове значення.Якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3
// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).
// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).
// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день (можна замість плану на день, назву дня англійською).
//     - Користувач вводить або має два числа.
//         Потрібно знайти та вивести максимальне число з тих двох .
//         Також потрібно врахувати коли введені рівні числа.
//----------------------------------------------------------------------------------------------------------------------
// - Є змінна х, якій ви надаєте довільне числове значення.Якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3
//----------------------------------------------------------------------------------------------------------------------

//----------------------------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------------------------

