// - Створити змінні. Присвоїти кожному з них значення: 'hello','owu','com', 'ua', 1, 10, -999, 123, 3.14, 2.7, 16, true, false.
//     Вивести кожну змінну за допомогою: console.log
//
// - Створити 3 змінних firstName, middleName, lastName, наповнити їх своїм ПІБ. З'єднати їх в одну змінну person (Не об'єкт, просто за допомоги конкатенації)
//
// - За допомогою оператора typeof визначити типи наступних змінних та вивести їх в консоль.
//     let a = 100; let b = '100'; let c = true;
//
// Додаткове для тих хто цікавився prompt`oм
// - За допомогою 3х різних prompt() отримати 3 слова які являються вашими Імям, По-Батькові та роками. та вивести в консоль


//-----------------------------------------------------------------------------------------------------------------
// - Створити змінні. Присвоїти кожному з них значення: 'hello','owu','com', 'ua', 1, 10, -999, 123, 3.14, 2.7, 16, true, false.
//     Вивести кожну змінну за допомогою: console.log
//-----------------------------------------------------------------------------------------------------------------
// let greeting = 'hello';
// let company = 'owu';
// let domain = 'ua';
// let one = 1;
// let ten = 10;
// let regretNum = -999;
// let hundred = 123;
// let pi = 3.14;
// let twoDotSeven = 2.7;
// let sixteen = 16;
// let boolT = true;
// let boolF = false;
//
// console.log(greeting, company, domain, one, ten, regretNum, hundred, pi, twoDotSeven, sixteen, boolT, boolF);
//-----------------------------------------------------------------------------------------------------------------
// - Створити 3 змінних firstName, middleName, lastName, наповнити їх своїм ПІБ. З'єднати їх в одну змінну person (Не об'єкт, просто за допомоги конкатенації)
//-----------------------------------------------------------------------------------------------------------------
// let firstName = 'Sasha';
// let middleName = 'Melnyk';
// let lastName = 'Andriyovych';
//
// let person = `${firstName} ${middleName} ${lastName}`;
// console.log(person);
//-----------------------------------------------------------------------------------------------------------------
// - За допомогою оператора typeof визначити типи наступних змінних та вивести їх в консоль.
//     let a = 100; let b = '100'; let c = true;
//-----------------------------------------------------------------------------------------------------------------
// let a = 100;
// let b = '100';
// let c = true;
// console.log(typeof a,typeof b,typeof c);
//-----------------------------------------------------------------------------------------------------------------
// Додаткове для тих хто цікавився prompt`oм
// - За допомогою 3х різних prompt() отримати 3 слова які являються вашими Імям, По-Батькові та роками. та вивести в консоль
//-----------------------------------------------------------------------------------------------------------------
// let firstName = prompt('Input first name: ');
// let middleName = prompt('Input middle name: ');
// let lastName = prompt('Input last name: ');
//
// let name = `${firstName} ${middleName} ${lastName}`;
// console.log(name);
//-----------------------------------------------------------------------------------------------------------------