//----------------------------------------------------------------------------------------------------------------------
// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.
//----------------------------------------------------------------------------------------------------------------------
// let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
// if (friends.length >= 3) {
//     console.log('Великий масив ,в якому 3 і більше елементів!');
// } else {
//     console.log('Маленький масив ,в якому 3 і менше елементів!');
// }
//----------------------------------------------------------------------------------------------------------------------
// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//   Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.
//----------------------------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------------------------
// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }
//----------------------------------------------------------------------------------------------------------------------
// let result = '';
// let a = 0;
// let b = 10;
// let answer = (a + b < 4) ? result = 'Мало' : result = 'Багато';
// console.log(result);
//----------------------------------------------------------------------------------------------------------------------
// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором
//----------------------------------------------------------------------------------------------------------------------
// let number = -100;
// let result = (number === 0) ? console.log(number) : (number < 0 && number >= -100) ? console.log(number) : (number > 0 && number <= 100) ? console.log(number) : console.log('Error!');
//----------------------------------------------------------------------------------------------------------------------
// - У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)
//----------------------------------------------------------------------------------------------------------------------
// let test = true;
// if (test) {
//     console.log('Вірно');
// } else if (!test) {
//     console.log('Неправильно');
// }
// let result = (test) ? console.log('Вірно') : (!test) ? console.log('Неправильно') : console.log('Помилка!');
//----------------------------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------------------------
