//----------------------------------------------------------------------------------------------------------------------
// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.
//----------------------------------------------------------------------------------------------------------------------
// let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
// if (friends.length >= 3) {
//     console.log('Великий масив ,в якому 3 і більше елементів!');
// } else {
//     console.log('Маленький масив ,в якому 3 і менше елементів!');
// }
//----------------------------------------------------------------------------------------------------------------------
// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//   Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.
//----------------------------------------------------------------------------------------------------------------------
// let a = 3;
// let b = 1;
// let c = 2;
//
// if (a > b) {
//     if (b > c) {
//         console.log(b);
//     } else if (a > c) {
//         console.log(c);
//     } else {
//        console.log(a);
//     }
// } else {
//     if (a > c) {
//         console.log(a);
//     } else if (b > c) {
//         console.log(c);
//     } else {
//         console.log(b);
//     }
// }
//----------------------------------------------------------------------------------------------------------------------
// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }
//----------------------------------------------------------------------------------------------------------------------
// let result = '';
// let a = 0;
// let b = 10;
// let answer = (a + b < 4) ? result = 'Мало' : result = 'Багато';
// console.log(result);
//----------------------------------------------------------------------------------------------------------------------
// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором
//----------------------------------------------------------------------------------------------------------------------
// let number = -100;
// let result = (number === 0) ? console.log(number) : (number < 0 && number >= -100) ? console.log(number) : (number > 0 && number <= 100) ? console.log(number) : console.log('Error!');
//----------------------------------------------------------------------------------------------------------------------
// - У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)
//----------------------------------------------------------------------------------------------------------------------
// let test = true;
// if (test) {
//     console.log('Вірно');
// } else if (!test) {
//     console.log('Неправильно');
// }
// let result = (test) ? console.log('Вірно') : (!test) ? console.log('Неправильно') : console.log('Помилка!');
//----------------------------------------------------------------------------------------------------------------------
// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!
//----------------------------------------------------------------------------------------------------------------------
// let user = prompt('Яка «офіційна» назва JavaScript?');
//
// if (user === 'ECMAScript') {
//     console.log('Правильно!');
// } else {
//     console.log('Не знаєте? ECMAScript!');
// }
//----------------------------------------------------------------------------------------------------------------------
// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.
//----------------------------------------------------------------------------------------------------------------------
// let user = +prompt();
//
// if (user >= 1 && user <= 20) {
//     console.log('1/3');
// } else if (user >= 21 && user <= 48) {
//     console.log('2/3');
// } else if (user >= 49 && user <= 90) {
//     console.log('3/3');
// } else {
//     console.log('Error!');
// }
//----------------------------------------------------------------------------------------------------------------------
// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО
//----------------------------------------------------------------------------------------------------------------------
// let number = +prompt();
//
// if (number === 10) {
//     console.log('ВІРНО')
// } else {
//     console.log('НЕВІРНО');
// }
//----------------------------------------------------------------------------------------------------------------------
// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН
//----------------------------------------------------------------------------------------------------------------------
// let temperature = 23;
// if (temperature >= 10 && temperature <= 22) {
//     console.log('Йдемо вчитися!');
// } else {
//     console.log('Онлайн!');
// }
//----------------------------------------------------------------------------------------------------------------------
// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .
//----------------------------------------------------------------------------------------------------------------------
// let user = 1;
//
// switch (user){
//     case 1:
//         console.log('Авто');
//         break;
//     case 2:
//         console.log('Мото');
//         break;
//     case 3:
//         console.log('Телефон');
//         break;
//     case 4:
//         console.log('Нічого');
//         break;
//     case 5:
//         console.log('Зуб');
//         break;
//     default:
//         console.log('Число не вірне!');
// }
//----------------------------------------------------------------------------------------------------------------------