//----------------------------------------------------------------------------------------------------------------------
// - Створити функцію конструктор для об'єктів User з полями id, name, surname , email, phone
// створити пустий масив, наповнити його 10 об'єктами new User(....)
//
// - Взяти масив з  User[] з попереднього завдання, та відфільтрувати , залишивши тільки об'єкти з парними id (filter)
//
// - Взяти масив з  User[] з попереднього завдання, та відсортувати його по id. по зростанню (sort)
//
// - створити класс для об'єктів Client з полями id, name, surname , email, phone, order (поле є масивом зі списком товарів)
// створити пустий масив, наповнити його 10 об'єктами Client
// - Взяти масив (Client [] з попереднього завдання).Відсортувати його по кількості товарів в полі order по зростанню. (sort)
//----------------------------------------------------------------------------------------------------------------------
// - Створити функцію конструктор для об'єктів User з полями id, name, surname , email, phone
// створити пустий масив, наповнити його 10 об'єктами new User(....)
//----------------------------------------------------------------------------------------------------------------------
function User(id, name, surname , email, phone) {
    this.id = id;
    this.name = name;
    this.surname = surname;
    this.email = email;
    this.phone = phone;
}

const user = [
    new User(1, 'Sanya', 'Melnyk', 'kunlem2004y@gmail.com', '0682279237'),
    new User(2, 'Sanya', 'Melnyk', 'kunlem2004y@gmail.com', '0682279237'),
    new User(3, 'Sanya', 'Melnyk', 'kunlem2004y@gmail.com', '0682279237'),
    new User(4, 'Sanya', 'Melnyk', 'kunlem2004y@gmail.com', '0682279237'),
    new User(5, 'Sanya', 'Melnyk', 'kunlem2004y@gmail.com', '0682279237'),
    new User(6, 'Sanya', 'Melnyk', 'kunlem2004y@gmail.com', '0682279237'),
    new User(7, 'Sanya', 'Melnyk', 'kunlem2004y@gmail.com', '0682279237'),
    new User(8, 'Sanya', 'Melnyk', 'kunlem2004y@gmail.com', '0682279237'),
    new User(9, 'Sanya', 'Melnyk', 'kunlem2004y@gmail.com', '0682279237'),
    new User(10, 'Sanya', 'Melnyk', 'kunlem2004y@gmail.com', '0682279237'),
];
// console.log(user);
//----------------------------------------------------------------------------------------------------------------------
// - Взяти масив з  User[] з попереднього завдання, та відфільтрувати , залишивши тільки об'єкти з парними id (filter)
//----------------------------------------------------------------------------------------------------------------------
console.log(user.filter(value => value.id % 2 === 0));
//----------------------------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------------------------