// - Сворити масив не цензцрних слів.
//     Сворити інпут текстового типу.
//     Якщо людина вводить слово і воно міститься в масиві не цензурних слів
// кинути алерт з попередженням.
//     Перевірку робити при натисканні на кнопку
//---------------------------------------------------
// const badWords = ['телепень','дурак','дибіл','тарас'];
// const f1 = document.forms.f1;
//
// f1.onsubmit = (e) => {
//     e.preventDefault();
//     let wordValue = f1.valueWord.value;
//
//     badWords.find(word => word === wordValue ? alert('Bad Word!') : null);
//     f1.valueSentence.value = '';
// }
//---------------------------------------------------
// - Сворити масив не цензцрних слів.
//     Сворити інпут текстового типу.
//     Потрібно перевіряти чи не містить ціле речення в собі погані слова.
//     Кинути алерт з попередженням у випадку якщо містить.
//     Перевірку робити при натисканні на кнопку
//---------------------------------------------------
// const badWords = ['телепень','дурак','дибіл','тарас'];
// const f2 = document.forms.f2;
//
// f2.onsubmit = (e) => {
//     e.preventDefault();
//     const valueSentence = f2.valueSentence.value.split(' ');
//     let arrWords = [];
//
//     for (let i = 0; i < valueSentence.length; i++) {
//         for (let j = 0; j < badWords.length; j++) {
//             if (valueSentence[i] === badWords[j]) {
//                 arrWords.push(valueSentence[i]);
//             }
//         }
//     }
//     f2.valueSentence.value = '';
//     arrWords.length ? console.log(arrWords) : console.log('No bad words!');
// }
//---------------------------------------------------
// - Создайте меню, которое раскрывается/сворачивается при клике
//---------------------------------------------------
//---------------------------------------------------